{
  "name": "Nguyen Bui Nam Truong",
  "slug": "TruongNBN",
  "title": "Frontend Developer & AI Integration Specialist",
  "email": "truongnbn.main@gmail.com",
  "phone": "+84327663738",
  "gender": "Male",
  "birthDate": "May 16, 2000",
  "address": {
    "full": "6 Alley 1/62/23 Bui Xuong Trach, Khuong Dinh, Thanh Xuan, Hanoi, Vietnam",
    "short": "6 Alley 1/62/23 Bui Xuong Trach, Thanh Xuan, Hanoi",
    "mapUrl": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d232.81411919042972!2d105.81977747479935!3d20.991598600000025!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ac8dca8cd4d1%3A0x951da39d67af948d!2zNiBI4bq7bSAxLzYyLzIzIELDuWkgWMawxqFuZyBUcuG6oWNoLCBLaMawxqFuZyDEkMOsbmgsIFRoYW5oIFh1w6JuLCBIw6AgTuG7mWksIFZpZXRuYW0!5e0!3m2!1sen!2s!4v1748450167186!5m2!1sen!2s"
  },
  "bio": "Welcome to my personal website! I'm a professional Frontend Developer with over 3 years of experience building modern web applications. I specialize in Next.js, React, TypeScript, and integrating AI into development workflows to optimize work efficiency and product quality.",
  "avatarUrl": "/assets/avatar.jpg",
  "cvUrl": "/assets/cv-nguyen-bui-nam-truong.en.pdf",
  "socialLinks": {
    "github": "https://github.com/devvitien",
    "facebook": "https://www.facebook.com/nguyenbuinamtruong",
    "linkedin": "",
    "twitter": ""
  },
  "education": [
    {
      "period": "2018-2024",
      "major": "Applied Mathematics and Computer Science",
      "school": "Hanoi University of Science and Technology",
      "description": "Completed undergraduate program at Hanoi University of Science and Technology. Graduated with good degree in Applied Mathematics and Computer Science"
    }
  ],
  "skills": [
    {
      "type": "Programming Languages",
      "data": [
        "Javascript, TypeScript: Experienced working with libraries and frameworks like React, NextJS, and Node.js.",
        "C++: Understanding of object-oriented programming and data structures."
      ]
    },
    {
      "type": "Tools and Technologies",
      "data": [
        "Git: Proficient in using for source code management and team collaboration.",
        "HTML/CSS: Developing user interfaces for web applications.",
        "React: Building interactive web applications.",
        "Next.js: React framework with App Router, SSR/SSG, API routes and performance optimization.",
        "Node.js: Developing backend for web applications."
      ]
    },
    {
      "type": "AI & Modern Development",
      "data": [
        "AI-Assisted Development: Proficient in using GitHub Copilot, Claude, ChatGPT for code generation, debugging and code review.",
        "Prompt Engineering: Optimizing prompts for AI tools to increase development efficiency and code quality.",
        "AI Integration: Integrating AI APIs and services into web applications to enhance user experience."
      ]
    },
    {
      "type": "Software Development Skills",
      "data": [
        "Agile Software Development: Basic understanding of Agile software development process and Scrum.",
        "Software Testing: Experience writing and executing unit tests and integration tests.",
        "Code Optimization: Ability to analyze and optimize code performance."
      ]
    },
    {
      "type": "Soft Skills",
      "data": [
        "Teamwork: Ability to work effectively in teams, contribute ideas and support colleagues. Problem solving: Logical thinking and analytical skills to solve technical problems.",
        "Communication: Good communication skills, both written and verbal, to work effectively with colleagues and clients.",
        "Creative thinking: Ability to come up with creative and breakthrough solutions for complex problems."
      ]
    },
    {
      "type": "Languages",
      "data": ["English: can read, write and communicate basically"]
    }
  ],
  "experience": [
    {
      "startDate": "01/2021",
      "endDate": "07/2024",
      "title": "Intern - Software Engineer",
      "company": "BKAV CORPORATION",
      "projects": [
        "Software Development: 6 months participating in browser software development using Chromium. (C++)",
        "Frontend developer: 3 years participating in enterprise management system development: Social Network, chat app, todolist and HR, finance management modules. Work: building interfaces for websites and mobile apps. Using ReactJS, ReactNative"
      ]
    },
    {
      "startDate": "04/2024",
      "endDate": "10/2024",
      "title": "Freelancer",
      "company": "none",
      "projects": [
        "Frontend developer: Text-To-Speech website. Result: https://speechconvert.com/"
      ]
    },
    {
      "startDate": "10/2024",
      "endDate": "present",
      "title": "Frontend developer",
      "company": "VCCORP CORPORATION",
      "projects": [
        "Content Management System (CMS) project: Utilizing AI tools for code generation optimization, automated testing and content processing."
      ]
    }
  ],
  "awards": [
    {
      "year": "2014",
      "description": "Silver medal in Coastal Mathematics Competition"
    },
    {
      "year": "2015",
      "description": "First prize in Provincial Mathematics Excellence Competition"
    },
    {
      "year": "2014",
      "description": "Encouragement prize in National Mathematics Excellence Competition"
    }
  ],
  "hobbies": [
    "Love exploring new technologies in information technology and AI.",
    "Love playing chess, watching chess tournaments.",
    "Exploring and experimenting with new AI tools to optimize workflow."
  ]
}
