{
  "name": "Nguyễn Bùi Nam Trường",
  "slug": "TruongNBN",
  "title": "Frontend Developer & AI Integration Specialist",
  "email": "truongnbn.main@gmail.com",
  "phone": "0327663738",
  "gender": "Nam",
  "birthDate": "16/05/2000",
  "address": {
    "full": "6 Hẻm 1/62/23 Bùi Xương Trạch, Khương Đình, Thanh Xuân, Hà Nội, Vietnam",
    "short": "6 Hẻm 1/62/23 Bùi Xương Trạch, Thanh Xuân, Hà Nội",
    "mapUrl": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d232.81411919042972!2d105.81977747479935!3d20.991598600000025!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3135ac8dca8cd4d1%3A0x951da39d67af948d!2zNiBI4bq7bSAxLzYyLzIzIELDuWkgWMawxqFuZyBUcuG6oWNoLCBLaMawxqFuZyDEkMOsbmgsIFRoYW5oIFh1w6JuLCBIw6AgTuG7mWksIFZpZXRuYW0!5e0!3m2!1sen!2s!4v1748450167186!5m2!1sen!2s"
  },
  "bio": "Chào mừng bạn đến với trang cá nhân của tôi! Tôi là một Frontend Developer chuyên nghiệp với hơn 3 năm kinh nghiệm phát triển ứng dụng web hiện đại. Tôi chuyên sâu về Next.js, React, TypeScript và tích hợp AI vào quy trình phát triển để tối ưu hóa hiệu suất công việc và chất lượng sản phẩm.",
  "avatarUrl": "/assets/avatar.jpg",
  "cvUrl": "/assets/cv-nguyen-bui-nam-truong.vi.pdf",
  "socialLinks": {
    "github": "https://github.com/devvitien",
    "facebook": "https://www.facebook.com/nguyenbuinamtruong",
    "linkedin": "https://www.linkedin.com/in/nguyễn-bùi-nam-trường-391a46322",
    "twitter": "",
    "website": "https://personal-profile-wheat.vercel.app/"
  },
  "education": [
    {
      "period": "2018-2024",
      "major": "Toán ứng dụng và Tin học",
      "school": "Đại học Bách Khoa Hà Nội",
      "description": "Hoàn thành chương trình bậc đại học tại Đại học Bách Khoa Hà Nội. Tốt nghiệp bằng khá ngành Toán ứng dụng và Tin học"
    }
  ],
  "skills": [
    {
      "type": "Ngôn ngữ lập trình",
      "data": [
        "Javascript, TypeScripts: Có kinh nghiệm làm việc với các thư viện, framework như React, NextJS và Node.js.",
        "C++: Hiểu biết về lập trình hướng đối tượng và cấu trúc dữ liệu."
      ]
    },
    {
      "type": "Công cụ và công nghệ",
      "data": [
        "Git: Sử dụng thành thạo để quản lý mã nguồn và làm việc nhóm.",
        "HTML/CSS: Phát triển giao diện người dùng cho các ứng dụng web.",
        "React: Xây dựng các ứng dụng web tương tác.",
        "Next.js: Framework React với App Router, SSR/SSG, API routes và tối ưu hóa performance.",
        "Node.js: Phát triển backend cho các ứng dụng web."
      ]
    },
    {
      "type": "AI & Modern Development",
      "data": [
        "AI-Assisted Development: Thành thạo sử dụng GitHub Copilot, Claude, ChatGPT cho việc code generation, debugging và code review.",
        "Prompt Engineering: Tối ưu hóa prompts cho các AI tools để tăng hiệu quả phát triển và chất lượng code.",
        "AI Integration: Tích hợp các AI APIs và services vào ứng dụng web để nâng cao trải nghiệm người dùng."
      ]
    },
    {
      "type": "Kỹ năng phát triển phần mềm",
      "data": [
        "Phát triển phần mềm Agile: Hiểu biết cơ bản về quy trình phát triển phần mềm Agile và Scrum.",
        "Kiểm thử phần mềm: Kinh nghiệm viết và thực hiện các bài kiểm thử đơn vị và kiểm thử tích hợp.",
        "Tối ưu hóa mã: Khả năng phân tích và tối ưu hóa hiệu suất mã nguồn."
      ]
    },
    {
      "type": "Kỹ năng mềm",
      "data": [
        "Làm việc nhóm: Khả năng làm việc hiệu quả trong nhóm, đóng góp ý kiến và hỗ trợ đồng nghiệp. Giải quyết vấn đề: Tư duy logic và khả năng phân tích, giải quyết các vấn đề kỹ thuật.",
        "Giao tiếp: Kỹ năng giao tiếp tốt, cả bằng văn bản và lời nói, để làm việc hiệu quả với đồng nghiệp và khách hàng.",
        "Tư duy sáng tạo: Khả năng đưa ra các giải pháp sáng tạo và đột phá cho các vấn đề phức tạp."
      ]
    },
    {
      "type": "Ngôn ngữ",
      "data": ["Tiếng Anh: có thể đọc viết và giao tiếp cơ bản"]
    }
  ],
  "experience": [
    {
      "startDate": "10/2024",
      "endDate": "hiện nay",
      "title": "Frontend Developer",
      "company": "CÔNG TY CỔ PHẦN VCCORP",
      "projects": [
        {
          "name": "Hệ thống Quản lý Nội dung thông minh (AI-Powered CMS)",
          "description": "Hệ thống CMS thế hệ mới tích hợp AI, bao gồm quản lý nội dung đa phương tiện, quản lý media library, social media management và content automation.",
          "mainResponsibilities": "Phát triển Frontend cho các module CMS, tích hợp AI tools để tự động hóa quy trình phát triển, code generation và automated testing.",
          "technologies": [
            "React.js",
            ".NET Core",
            "Tailwind CSS",
            "TypeScript",
            "AI Integration Tools"
          ],
          "teamSize": [4, 8]
        }
      ]
    },
    {
      "startDate": "04/2024",
      "endDate": "10/2024",
      "title": "Freelancer Frontend Developer",
      "company": "Dự án cá nhân",
      "projects": [
        {
          "name": "Website Text-To-Speech chuyên nghiệp",
          "description": "Nền tảng chuyển đổi văn bản thành giọng nói với hỗ trợ đa ngôn ngữ, nhiều giọng đọc tự nhiên và các tùy chọn tùy chỉnh nâng cao.",
          "mainResponsibilities": "Thiết kế và phát triển hoàn chỉnh giao diện người dùng, tích hợp API AI voice synthesis, tối ưu hóa trải nghiệm người dùng và performance.",
          "technologies": [
            "React.js",
            "Next.js",
            "Tailwind CSS",
            "Material-UI",
            "Node.js",
            "Express.js",
            "MongoDB"
          ],
          "teamSize": 2
        }
      ]
    },
    {
      "startDate": "01/2021",
      "endDate": "07/2024",
      "title": "Sinh viên thực tập - Chuyên viên lập trình",
      "company": "CÔNG TY CỔ PHẦN BKAV",
      "projects": [
        {
          "name": "Phần mềm trình duyệt web Chromium",
          "description": "Phần mềm trình duyệt web tích hợp các chức năng bảo mật nâng cao, quản lý tab thông minh và đồng bộ hóa dữ liệu người dùng.",
          "mainResponsibilities": "Tham gia thực tập phát triển phần mềm, nghiên cứu và fix bug, phát triển các tính năng mới cho core engine của trình duyệt.",
          "technologies": ["Chromium", "C++", "Git", "Visual Studio"],
          "teamSize": [3, 5]
        },
        {
          "name": "Hệ thống phần mềm quản trị doanh nghiệp (ERP)",
          "description": "Hệ thống ERP tích hợp đầy đủ các module: Mạng xã hội nội bộ, Chat realtime, Todo management, Email system, Quản lý nhân sự và Quản lý tài chính.",
          "mainResponsibilities": "Phát triển Frontend từ giai đoạn khởi tạo đến triển khai sản phẩm hoàn chỉnh. Xây dựng giao diện cho cả web application và mobile app.",
          "technologies": [
            "React.js",
            "React Native",
            "Ant Design",
            "Redux",
            "Git",
            "HTML5",
            "CSS3",
            "JavaScript ES6+"
          ],
          "teamSize": [6, 10]
        }
      ]
    }
  ],
  "awards": [
    {
      "year": "2014",
      "description": "Huy chương Bạc thi duyên hải môn Toán"
    },
    {
      "year": "2015",
      "description": "Giải Nhất học sinh giỏi cấp tỉnh môn Toán"
    },
    {
      "year": "2014",
      "description": "Giải khuyến khích học sinh giỏi cấp quốc gia môn Toán"
    }
  ],
  "hobbies": [
    "Thích tìm hiểu các công nghệ mới trong lĩnh vực công nghệ thông tin và AI.",
    "Thích chơi cờ vua, xem các giải cờ vua.",
    "Tìm hiểu và thử nghiệm các công cụ AI mới để tối ưu workflow."
  ]
}
